Repository: alaaRashed2001/turath-code
Catalog: lib/l10n/app_*.arb
Languages: ar

# welcomeHeritageCode
source: Welcome to Heritage Code
ar: مرحبًا بك في تراث كود

# heritageMeetsTechnology
source: Where heritage meets technology
ar: حيث يلتقي التراث بالتقنية

source: Team Members
ar: فريق العمل

source: Turath
ar: تراث

source: Games
ar: ألعاب

source: Rate Us
ar: قيّمنا

source: Profile
ar: البروفايل

# palestineNationTale
source: Palestine: A Nation’s Tale
ar: فلسطين، حكاية وطن

source: Palestinian Heritage Hub
ar: مركز التراث الفلسطيني

# talesFromHomeland
source: Tales from the Homeland
ar: حكايا من الوطن

# slidesHeritage
source: Slides of Heritage
ar: شرائح من تراثنا

# playHeritage
source: Play the Heritage
ar: العب وتعلّم التراث

source: Toggle Theme
ar: تبديل الثيم

source: Toggle Language
ar: تبديل اللغة

# grade
source: Grade Eight
ar: الصف الثامن

# location_yasuf
source: Palestine - Yasuf
ar: فلسطين - ياسوف

# project_name
source: Turath Code
ar: تراث كود

# surveyTitle
source: 📝 Exhibition Evaluation
ar: 📝 تقييم المعرض

# surveyIntro
source: Please evaluate your experience in the digital exhibition:
ar: يرجى تقييم تجربتك في المعرض الرقمي:

# question1
source: What do you think of 'Palestine Through Our Eyes' content?
ar: ما رأيك بمحتوى "فلسطين بعيوننا"؟

# question2
source: How do you rate interactive apps like Scratch and Canva?
ar: ما رأيك بالتطبيقات التفاعلية مثل Scratch و Canva؟

# question3
source: Did the exhibition help you understand Palestinian heritage?
ar: هل ساعدك المعرض على فهم التراث الفلسطيني؟

# question4
source: How useful was the village and city journey?
ar: ما مدى استفادتك من رحلة القرى والمدن؟

# question5
source: Would you like a similar digital experience again?
ar: هل ترغب بتجربة رقمية مشابهة لاحقًا؟

source: Excellent
ar: ممتاز

source: Good
ar: جيد

source: Acceptable
ar: مقبول

source: Weak
ar: ضعيف

# sendEvaluation
source: Submit Evaluation
ar: إرسال التقييم

# suggestionLabel
source: 💡 Any suggestions to improve the exhibition?
ar: 💡 هل لديك اقتراح لتحسين المعرض؟

# thankYou
source: Thank you for participating 💚
ar: شكراً لمشاركتك 💚

# yourSuggestion
source: 💬 Your suggestion: {suggestion}
ar: 💬 اقتراحك: {suggestion}

# resubmit
source: Retake Survey
ar: إعادة التقييم

# prevSurvey
source: View Previous Survey
ar: عرض التقييم السابق

# snackbarIncomplete
source: Please answer all questions
ar: يرجى الإجابة على جميع الأسئلة

# section1
source: Explore Palestine
ar: استكشاف فلسطين

# section2
source: Visual Heritage
ar: تراث بصري

# section3
source: Educational Games
ar: ألعاب تعليمية

# section4
source: Creative Works
ar: أعمال إبداعية

source: Palestine in Our Eyes
ar: فلسطين بعيوننا

# villageToCity
source: From Village to City
ar: من قرية إلى مدينة

# ourHeritageTitle
source: 🖼 Our Heritage... Stories of Ancestors
ar: 🖼 تراثنا... حكاية الأجداد

# ourHeritageGoal
source: 🎯 Goal: Preserve the collective memory through fun digital technologies
ar: 🎯 الهدف: حفظ الذاكرة الشعبية من خلال تقنيات رقمية ممتعة

# pageFourTitle
source: 🖼️ Our Pens Speak
ar: 🖼️ أقلامنا تحكي

source: 🎮 Poetic Games
ar: 🎮 ألعاب شعرية

source: 🎞️ Poetic Videos
ar: 🎞️ فيديوهات شعرية

# openLinkFailed
source: Failed to open link: {title}
ar: تعذر فتح الرابط: {title}
